vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
/**
 * @file dmx.cpp
 */
/* Copyright (C) 2021-2025 by Arjan van Vught mailto:info@gd32-dmx.org
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#if defined(CONFIG_TIMER6_HAVE_NO_IRQ_HANDLER)
#error
#endif

#pragma GCC push_options
#pragma GCC optimize("O3")
#pragma GCC optimize("-fprefetch-loop-arrays")

#include <cstdint>
#include <cstring>
#include <algorithm>
#include <cassert>

#include "dmx.h"
#include "dmxconst.h"
#include "rdm.h"
#include "rdm_e120.h"
#include "gd32.h"
#include "gd32_dma.h"
#include "gd32_uart.h"
#include "dmx/dmx_config.h"
#include "gd32/dmx_assert.h"
#include "dmx_internal.h"
#include "logic_analyzer.h"
#include "debug.h"

extern struct HwTimersSeconds g_Seconds;

namespace dmx
{

static constexpr auto kDmxSlotsCompleteFlag = 0x8000U;
static constexpr auto kRdmSlotsCompleteFlag = 0x4000U;

enum class TxRxState
{
    kIdle,
    kBreak,
    kMab,
    kDmxdata,
    kDmxinter,
    kRdmdata,
    kChecksumh,
    kChecksuml,
    kRdmdisc
};

enum class PortState
{
    kIdle,
    kTx,
    kRx
};

struct TxDmxDataPacket
{
    uint8_t data[dmx::buffer::SIZE]; // multiple of uint32_t
    uint32_t length;
};

struct TxDmxPacket
{
    TxDmxDataPacket data[2];
    uint32_t write_index;
    uint32_t read_index;
    bool data_pending;
};

struct TxData
{
    TxDmxPacket dmx;
    OutputStyle output_style ALIGNED;
    volatile TxRxState State;
};

struct DmxTransmit
{
    uint32_t break_time;
    uint32_t mab_time;
    uint32_t inter_time;
};

struct RxDmxPackets
{
    uint32_t per_second;
    uint32_t count;
    uint32_t count_previous;
};

struct RxDmxData
{
    uint8_t data[dmx::buffer::SIZE] ALIGNED; // multiple of uint32_t
    uint32_t slots_in_packet;
};

#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
enum class ActiveBuffer
{
    kA,
    kB
};
#endif

struct RxData
{
    struct Dmx
    {
#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
        volatile RxDmxData buffer_a;
        volatile RxDmxData buffer_b;
        ActiveBuffer active{ActiveBuffer::kA}; // Active write buffer
#else
        volatile RxDmxData current;
#endif
        RxDmxData previous;
    } dmx ALIGNED;
    struct Rdm
    {
        volatile uint8_t data[sizeof(struct TRdmMessage)] ALIGNED;
        volatile uint32_t index;
    } rdm ALIGNED;
    volatile TxRxState State{TxRxState::kIdle};
} ALIGNED;

struct DirGpio
{
    uint32_t port;
    uint32_t pin;
};
} // namespace dmx

static constexpr dmx::DirGpio kDirGpio[DMX_MAX_PORTS] = {
    {dmx::config::DIR_PORT_0_GPIO_PORT, dmx::config::DIR_PORT_0_GPIO_PIN},
#if DMX_MAX_PORTS >= 2
    {dmx::config::DIR_PORT_1_GPIO_PORT, dmx::config::DIR_PORT_1_GPIO_PIN},
#endif
#if DMX_MAX_PORTS >= 3
    {dmx::config::DIR_PORT_2_GPIO_PORT, dmx::config::DIR_PORT_2_GPIO_PIN},
#endif
#if DMX_MAX_PORTS >= 4
    {dmx::config::DIR_PORT_3_GPIO_PORT, dmx::config::DIR_PORT_3_GPIO_PIN},
#endif
#if DMX_MAX_PORTS >= 5
    {dmx::config::DIR_PORT_4_GPIO_PORT, dmx::config::DIR_PORT_4_GPIO_PIN},
#endif
#if DMX_MAX_PORTS >= 6
    {dmx::config::DIR_PORT_5_GPIO_PORT, dmx::config::DIR_PORT_5_GPIO_PIN},
#endif
#if DMX_MAX_PORTS >= 7
    {dmx::config::DIR_PORT_6_GPIO_PORT, dmx::config::DIR_PORT_6_GPIO_PIN},
#endif
#if DMX_MAX_PORTS == 8
    {dmx::config::DIR_PORT_7_GPIO_PORT, dmx::config::DIR_PORT_7_GPIO_PIN},
#endif
};

static volatile dmx::PortState sv_PortState[dmx::config::max::PORTS] ALIGNED;

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
static volatile dmx::TotalStatistics sv_TotalStatistics[dmx::config::max::PORTS] ALIGNED;
#endif

// DMX RX

static volatile dmx::RxDmxPackets sv_nRxDmxPackets[dmx::config::max::PORTS] ALIGNED;

// RDM RX
volatile uint32_t gsv_RdmDataReceiveEnd;

// DMX RDM RX

static volatile dmx::RxData sv_RxBuffer[dmx::config::max::PORTS] ALIGNED;

// DMX TX

static dmx::TxData s_TxBuffer[dmx::config::max::PORTS] ALIGNED SECTION_DMA_BUFFER;
static dmx::DmxTransmit s_nDmxTransmit;

#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
// The active DMX data buffer for writes
volatile dmx::RxDmxData& GetWriteDmxDataBuffer(uint32_t port_index)
{
    if (sv_RxBuffer[port_index].dmx.active == dmx::ActiveBuffer::kA)
    {
        return sv_RxBuffer[port_index].dmx.buffer_a;
    }
    return sv_RxBuffer[port_index].dmx.buffer_b;
}

// The non-active DMX data buffer for reads
volatile dmx::RxDmxData& GetReadDmxDataBuffer(uint32_t port_index)
{
    if (sv_RxBuffer[port_index].dmx.active == dmx::ActiveBuffer::kA)
    {
        return sv_RxBuffer[port_index].dmx.buffer_b;
    }
    return sv_RxBuffer[port_index].dmx.buffer_a;
}

// Swap the active buffer for writing
void SwapActiveDmxDataBuffer(uint32_t port_index)
{
    if (sv_RxBuffer[port_index].dmx.active == dmx::ActiveBuffer::kA)
    {
        sv_RxBuffer[port_index].dmx.active = dmx::ActiveBuffer::kB;
    }
    else
    {
        sv_RxBuffer[port_index].dmx.active = dmx::ActiveBuffer::kA;
    }
}
#endif

template <uint32_t uart, uint32_t port_index> void IrqHandlerDmxRdmInput()
{
#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
    auto& dmx_data_buffer = GetWriteDmxDataBuffer(port_index);
#else
#endif

    const auto kIsFlagIdleFrame = (USART_REG_VAL(uart, USART_FLAG_IDLE) & BIT(USART_BIT_POS(USART_FLAG_IDLE))) == BIT(USART_BIT_POS(USART_FLAG_IDLE));
    /*
     * Software can clear this bit by reading the USART_STAT and USART_DATA registers one by one.
     */
    if (kIsFlagIdleFrame)
    {
        static_cast<void>(GET_BITS(USART_RDATA(uart), 0U, 8U));

#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
        switch (sv_RxBuffer[port_index].State)
        {
            case dmx::TxRxState::kBreak:
                break;
            case dmx::TxRxState::kDmxdata:
            {
                dmx_data_buffer.slots_in_packet |= dmx::kDmxSlotsCompleteFlag;
                break;
            }
            case dmx::TxRxState::kRdmdisc:
            {
                sv_RxBuffer[port_index].State = dmx::TxRxState::kIdle;
                sv_RxBuffer[port_index].rdm.index |= dmx::kRdmSlotsCompleteFlag;
                break;
            }
            default:
            {
                sv_RxBuffer[port_index].State = dmx::TxRxState::kIdle;
                break;
            }
        }

        return;
#else
        if (sv_RxBuffer[port_index].State == dmx::TxRxState::kDmxdata)
        {
            sv_RxBuffer[port_index].State = dmx::TxRxState::kIdle;
            sv_RxBuffer[port_index].dmx.current.slots_in_packet |= 0x8000;

            return;
        }

        if (sv_RxBuffer[0].State == dmx::TxRxState::kRdmdisc)
        {
            sv_RxBuffer[port_index].State = dmx::TxRxState::kIdle;
            sv_RxBuffer[port_index].rdm.index |= 0x4000;

            return;
        }

        return;
#endif
    }

    const auto kIsFlagFrameError = (USART_REG_VAL(uart, USART_FLAG_FERR) & BIT(USART_BIT_POS(USART_FLAG_FERR))) == BIT(USART_BIT_POS(USART_FLAG_FERR));
    /*
     * Software can clear this bit by reading the USART_STAT and USART_DATA registers one by one.
     */
    if (kIsFlagFrameError)
    {
        static_cast<void>(GET_BITS(USART_RDATA(uart), 0U, 8U));

#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
        switch (sv_RxBuffer[port_index].State)
        {
            case dmx::TxRxState::kRdmdisc:
            case dmx::TxRxState::kIdle:
            {
                break;
            }
            case dmx::TxRxState::kDmxdata:
            {
                if (!(dmx_data_buffer.slots_in_packet & dmx::kDmxSlotsCompleteFlag))
                {
                    return;
                }
                break;
            }
            case dmx::TxRxState::kRdmdata:
            {
                if (!(sv_RxBuffer[port_index].rdm.index & dmx::kRdmSlotsCompleteFlag))
                {
                    return;
                }
                break;
            }
            default:
            {
                sv_RxBuffer[port_index].State = dmx::TxRxState::kIdle;
                return;
            }
        }

