vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
        sv_RxBuffer[port_index].State = dmx::TxRxState::kBreak;
        SwapActiveDmxDataBuffer(port_index);
#else
        if (sv_RxBuffer[port_index].State == dmx::TxRxState::kIdle)
        {
            sv_RxBuffer[port_index].State = dmx::TxRxState::kBreak;
        }

        return;
#endif
    }

    const auto kData = static_cast<uint8_t>(GET_BITS(USART_RDATA(uart), 0U, 8U));

    switch (sv_RxBuffer[port_index].State)
    {
        case dmx::TxRxState::kIdle:
            sv_RxBuffer[port_index].State = dmx::TxRxState::kRdmdisc;
            sv_RxBuffer[port_index].rdm.data[0] = kData;
            sv_RxBuffer[port_index].rdm.index = 1;
            break;
        case dmx::TxRxState::kBreak:
            switch (kData)
            {
                case dmx::kStartCode:
#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
                    dmx_data_buffer.data[0] = dmx::kStartCode;
                    dmx_data_buffer.slots_in_packet = 1;
#else
                    sv_RxBuffer[port_index].dmx.current.data[0] = dmx::kStartCode;
                    sv_RxBuffer[port_index].dmx.current.slots_in_packet = 1;
#endif
                    sv_nRxDmxPackets[port_index].count = sv_nRxDmxPackets[port_index].count + 1;
                    sv_RxBuffer[port_index].State = dmx::TxRxState::kDmxdata;
                    break;
                case E120_SC_RDM:
                    sv_RxBuffer[port_index].rdm.data[0] = E120_SC_RDM;
                    sv_RxBuffer[port_index].rdm.index = 1;
                    sv_RxBuffer[port_index].State = dmx::TxRxState::kRdmdata;
                    break;
                default:
#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
                    dmx_data_buffer.slots_in_packet = 0;
#else
                    sv_RxBuffer[port_index].dmx.current.slots_in_packet = 0;
#endif
                    sv_RxBuffer[port_index].rdm.index = 0;
                    sv_RxBuffer[port_index].State = dmx::TxRxState::kIdle;
                    break;
            }
            break;
        case dmx::TxRxState::kDmxdata:
        {
#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
            dmx_data_buffer.slots_in_packet &= ~dmx::kDmxSlotsCompleteFlag;
            dmx_data_buffer.data[dmx_data_buffer.slots_in_packet++] = kData;

            if (dmx_data_buffer.slots_in_packet > dmx::kChannelsMax)
            {
                dmx_data_buffer.slots_in_packet |= dmx::kDmxSlotsCompleteFlag;

                sv_RxBuffer[port_index].State = dmx::TxRxState::kIdle;
                break;
            }
#else
            auto index = sv_RxBuffer[port_index].dmx.current.slots_in_packet;
            sv_RxBuffer[port_index].dmx.current.data[index] = kData;
            index++;
            sv_RxBuffer[port_index].dmx.current.slots_in_packet = index;

            if (index > dmx::kChannelsMax)
            {
                index |= 0x8000;
                sv_RxBuffer[port_index].dmx.current.slots_in_packet = index;
                sv_RxBuffer[port_index].State = dmx::TxRxState::kIdle;
                break;
            }
#endif
        }
        break;
        case dmx::TxRxState::kRdmdata:
        {
            auto index = sv_RxBuffer[port_index].rdm.index;
            sv_RxBuffer[port_index].rdm.data[index] = kData;
            index++;
            sv_RxBuffer[port_index].rdm.index = index;

            const auto* p = reinterpret_cast<volatile struct TRdmMessage*>(&sv_RxBuffer[port_index].rdm.data[0]);

            if ((index >= 24) && (index <= sizeof(struct TRdmMessage)) && (index == p->message_length))
            {
                sv_RxBuffer[port_index].State = dmx::TxRxState::kChecksumh;
            }
            else if (index > sizeof(struct TRdmMessage))
            {
                sv_RxBuffer[port_index].State = dmx::TxRxState::kIdle;
            }
        }
        break;
        case dmx::TxRxState::kChecksumh:
        {
            auto index = sv_RxBuffer[port_index].rdm.index;
            sv_RxBuffer[port_index].rdm.data[index] = kData;
            index++;
            sv_RxBuffer[port_index].rdm.index = index;
            sv_RxBuffer[port_index].State = dmx::TxRxState::kChecksuml;
        }
        break;
        case dmx::TxRxState::kChecksuml:
        {
            auto index = sv_RxBuffer[port_index].rdm.index;
            sv_RxBuffer[port_index].rdm.data[index] = kData;
            index |= 0x4000;
            sv_RxBuffer[port_index].rdm.index = index;
            sv_RxBuffer[port_index].State = dmx::TxRxState::kIdle;
            gsv_RdmDataReceiveEnd = DWT->CYCCNT;
        }
        break;
        case dmx::TxRxState::kRdmdisc:
        {
            auto index = sv_RxBuffer[port_index].rdm.index;

            if (index < 24)
            {
                sv_RxBuffer[port_index].rdm.data[index] = kData;
                index++;
                sv_RxBuffer[port_index].rdm.index = index;
            }
        }
        break;
        default:
#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
            dmx_data_buffer.slots_in_packet = 0;
#else
            sv_RxBuffer[port_index].dmx.current.slots_in_packet = 0;
#endif
            sv_RxBuffer[port_index].rdm.index = 0;
            sv_RxBuffer[port_index].State = dmx::TxRxState::kIdle;
            break;
    }
}

extern "C"
{
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
#if defined(DMX_USE_USART0)
    void USART0_IRQHandler()
    {
        IrqHandlerDmxRdmInput<USART0, dmx::config::USART0_PORT>();
    }
#endif
#if defined(DMX_USE_USART1)
    void USART1_IRQHandler()
    {
        IrqHandlerDmxRdmInput<USART1, dmx::config::USART1_PORT>();
    }
#endif
#if defined(DMX_USE_USART2)
    void USART2_IRQHandler()
    {
        IrqHandlerDmxRdmInput<USART2, dmx::config::USART2_PORT>();
    }
#endif
#if defined(DMX_USE_UART3)
    void UART3_IRQHandler()
    {
        IrqHandlerDmxRdmInput<UART3, dmx::config::UART3_PORT>();
    }
#endif
#if defined(DMX_USE_UART4)
    void UART4_IRQHandler()
    {
        IrqHandlerDmxRdmInput<UART4, dmx::config::UART4_PORT>();
    }
#endif
#if defined(DMX_USE_USART5)
    void USART5_IRQHandler()
    {
        IrqHandlerDmxRdmInput<USART5, dmx::config::USART5_PORT>();
    }
#endif
#if defined(DMX_USE_UART6)
    void UART6_IRQHandler()
    {
        IrqHandlerDmxRdmInput<UART6, dmx::config::UART6_PORT>();
    }
#endif
#if defined(DMX_USE_UART7)
    void UART7_IRQHandler()
    {
        IrqHandlerDmxRdmInput<UART7, dmx::config::UART7_PORT>();
    }
#endif
#endif
}

static void Timer1Config()
{
    rcu_periph_clock_enable(RCU_TIMER1);
    timer_deinit(TIMER1);

    timer_parameter_struct timer_initpara;
    timer_struct_para_init(&timer_initpara);

    timer_initpara.prescaler = TIMER_PSC_1MHZ;
    timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
    timer_initpara.counterdirection = TIMER_COUNTER_UP;
    timer_initpara.period = ~0;
    timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
    timer_initpara.repetitioncounter = 0;
    timer_init(TIMER1, &timer_initpara);

    timer_flag_clear(TIMER1, ~0);
    timer_interrupt_flag_clear(TIMER1, ~0);

#if defined(DMX_USE_USART0)
    timer_channel_output_mode_config(TIMER1, TIMER_CH_0, TIMER_OC_MODE_ACTIVE);
    timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_0, ~0);
    timer_interrupt_enable(TIMER1, TIMER_INT_CH0);
#endif /* DMX_USE_USART0 */

