vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
#if defined(DMX_USE_USART1)
    timer_channel_output_mode_config(TIMER1, TIMER_CH_1, TIMER_OC_MODE_ACTIVE);
    timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_1, ~0);
    timer_interrupt_enable(TIMER1, TIMER_INT_CH1);
#endif /* DMX_USE_USART1 */

#if defined(DMX_USE_USART2)
    timer_channel_output_mode_config(TIMER1, TIMER_CH_2, TIMER_OC_MODE_ACTIVE);
    timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_2, ~0);
    timer_interrupt_enable(TIMER1, TIMER_INT_CH2);
#endif /* DMX_USE_USART2 */

#if defined(DMX_USE_UART3)
    timer_channel_output_mode_config(TIMER1, TIMER_CH_3, TIMER_OC_MODE_ACTIVE);
    timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_3, ~0);
    timer_interrupt_enable(TIMER1, TIMER_INT_CH3);
#endif /* DMX_USE_UART3 */

    NVIC_SetPriority(TIMER1_IRQn, 0);
    NVIC_EnableIRQ(TIMER1_IRQn);

    timer_enable(TIMER1);
}

#if defined(DMX_USE_UART4) || defined(DMX_USE_USART5) || defined(DMX_USE_UART6) || defined(DMX_USE_UART7)
static void timer4_config()
{
    rcu_periph_clock_enable(RCU_TIMER4);
    timer_deinit(TIMER4);

    timer_parameter_struct timer_initpara;
    timer_struct_para_init(&timer_initpara);

    timer_initpara.prescaler = TIMER_PSC_1MHZ;
    timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
    timer_initpara.counterdirection = TIMER_COUNTER_UP;
    timer_initpara.period = ~0;
    timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
    timer_initpara.repetitioncounter = 0;
    timer_init(TIMER4, &timer_initpara);

    timer_flag_clear(TIMER4, ~0);
    timer_interrupt_flag_clear(TIMER4, ~0);

#if defined(DMX_USE_UART4)
    timer_channel_output_mode_config(TIMER4, TIMER_CH_0, TIMER_OC_MODE_ACTIVE);
    timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_0, ~0);
    timer_interrupt_enable(TIMER4, TIMER_INT_CH0);
#endif /* DMX_USE_UART4 */

#if defined(DMX_USE_USART5)
    timer_channel_output_mode_config(TIMER4, TIMER_CH_1, TIMER_OC_MODE_ACTIVE);
    timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_1, ~0);
    timer_interrupt_enable(TIMER4, TIMER_INT_CH1);
#endif /* DMX_USE_USART5 */

#if defined(DMX_USE_UART6)
    timer_channel_output_mode_config(TIMER4, TIMER_CH_2, TIMER_OC_MODE_ACTIVE);
    timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_2, ~0);
    timer_interrupt_enable(TIMER4, TIMER_INT_CH2);
#endif /* DMX_USE_UART6 */

#if defined(DMX_USE_UART7)
    timer_channel_output_mode_config(TIMER4, TIMER_CH_3, TIMER_OC_MODE_ACTIVE);
    timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_3, ~0);
    timer_interrupt_enable(TIMER4, TIMER_INT_CH3);
#endif /* DMX_USE_UART7 */

    NVIC_SetPriority(TIMER4_IRQn, 0);
    NVIC_EnableIRQ(TIMER4_IRQn);

    timer_enable(TIMER4);
}
#endif

static void UsartDmaConfig()
{
    DMA_PARAMETER_STRUCT dma_init_struct;
    rcu_periph_clock_enable(RCU_DMA0);
    rcu_periph_clock_enable(RCU_DMA1);
#if defined(GD32H7XX)
    rcu_periph_clock_enable(RCU_DMAMUX);
#endif
#if defined(DMX_USE_USART0)
    /*
     * USART 0 TX
     */
    dma_deinit(USART0_DMAx, USART0_TX_DMA_CHx);
#if defined(GD32H7XX)
    dma_init_struct.request = DMA_REQUEST_USART0_TX;
#endif
    dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
#else
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
#if defined(GD32H7XX)
    dma_init_struct.periph_addr = (uint32_t)&USART_TDATA(USART0);
#else
    dma_init_struct.periph_addr = USART0 + 0x04U;
#endif
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
    dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init(USART0_DMAx, USART0_TX_DMA_CHx, &dma_init_struct);
    /* configure DMA mode */
    dma_circulation_disable(USART0_DMAx, USART0_TX_DMA_CHx);
    dma_memory_to_memory_disable(USART0_DMAx, USART0_TX_DMA_CHx);
#if defined(GD32F4XX)
    dma_channel_subperipheral_select(USART0_DMAx, USART0_TX_DMA_CHx, USART0_TX_DMA_SUBPERIx);
#endif
    Gd32DmaInterruptDisable<USART0_DMAx, USART0_TX_DMA_CHx, DMA_INTERRUPT_DISABLE>();
#if !defined(GD32F4XX)
    NVIC_SetPriority(DMA0_Channel3_IRQn, 1);
    NVIC_EnableIRQ(DMA0_Channel3_IRQn);
#else
    NVIC_SetPriority(DMA1_Channel7_IRQn, 1);
    NVIC_EnableIRQ(DMA1_Channel7_IRQn);
#endif
#endif /* DMX_USE_USART0 */
#if defined(DMX_USE_USART1)
    /*
     * USART 1 TX
     */
    dma_deinit(USART1_DMAx, USART1_TX_DMA_CHx);
#if defined(GD32H7XX)
    dma_init_struct.request = DMA_REQUEST_USART1_TX;
#endif
    dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
#else
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
#if defined(GD32H7XX)
    dma_init_struct.periph_addr = (uint32_t)&USART_TDATA(USART1);
#else
    dma_init_struct.periph_addr = USART1 + 0x04U;
#endif
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
    dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init(USART1_DMAx, USART1_TX_DMA_CHx, &dma_init_struct);
    /* configure DMA mode */
    dma_circulation_disable(USART1_DMAx, USART1_TX_DMA_CHx);
    dma_memory_to_memory_disable(USART1_DMAx, USART1_TX_DMA_CHx);
#if defined(GD32F4XX)
    dma_channel_subperipheral_select(USART1_DMAx, USART1_TX_DMA_CHx, USART1_TX_DMA_SUBPERIx);
#endif
    Gd32DmaInterruptDisable<USART1_DMAx, USART1_TX_DMA_CHx, DMA_INTERRUPT_DISABLE>();
    NVIC_SetPriority(DMA0_Channel6_IRQn, 1);
    NVIC_EnableIRQ(DMA0_Channel6_IRQn);
#endif /* DMX_USE_USART1 */
#if defined(DMX_USE_USART2)
    /*
     * USART 2 TX
     */
    dma_deinit(USART2_DMAx, USART2_TX_DMA_CHx);
#if defined(GD32H7XX)
    dma_init_struct.request = DMA_REQUEST_USART2_TX;
#endif
    dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
#else
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
    dma_init_struct.periph_addr = (uint32_t)&USART_TDATA(USART2);
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
    dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init(USART2_DMAx, USART2_TX_DMA_CHx, &dma_init_struct);
    /* configure DMA mode */
    dma_circulation_disable(USART2_DMAx, USART2_TX_DMA_CHx);
    dma_memory_to_memory_disable(USART2_DMAx, USART2_TX_DMA_CHx);
#if defined(GD32F4XX)
    dma_channel_subperipheral_select(USART2_DMAx, USART2_TX_DMA_CHx, USART2_TX_DMA_SUBPERIx);
#endif
    Gd32DmaInterruptDisable<USART2_DMAx, USART2_TX_DMA_CHx, DMA_INTERRUPT_DISABLE>();
#if defined(GD32F4XX) || defined(GD32H7XX)
    NVIC_SetPriority(DMA0_Channel3_IRQn, 1);
    NVIC_EnableIRQ(DMA0_Channel3_IRQn);
#else
    NVIC_SetPriority(DMA0_Channel1_IRQn, 1);
    NVIC_EnableIRQ(DMA0_Channel1_IRQn);
#endif
#endif /* DMX_USE_USART2 */
#if defined(DMX_USE_UART3)
    /*
     * UART 3 TX
     */
    dma_deinit(UART3_DMAx, UART3_TX_DMA_CHx);
#if defined(GD32H7XX)
    dma_init_struct.request = DMA_REQUEST_UART3_TX;
#endif
    dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
#else
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
#if defined(GD32H7XX)
    dma_init_struct.periph_addr = (uint32_t)&USART_TDATA(UART3);
#else
    dma_init_struct.periph_addr = UART3 + 0x04U;
#endif
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
    dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init(UART3_DMAx, UART3_TX_DMA_CHx, &dma_init_struct);
    /* configure DMA mode */
    dma_circulation_disable(UART3_DMAx, UART3_TX_DMA_CHx);
    dma_memory_to_memory_disable(UART3_DMAx, UART3_TX_DMA_CHx);
#if defined(GD32F4XX)
    dma_channel_subperipheral_select(UART3_DMAx, UART3_TX_DMA_CHx, UART3_TX_DMA_SUBPERIx);
#endif
    Gd32DmaInterruptDisable<UART3_DMAx, UART3_TX_DMA_CHx, DMA_INTERRUPT_DISABLE>();
#if !defined(GD32F4XX)
    NVIC_SetPriority(DMA1_Channel4_IRQn, 1);
    NVIC_EnableIRQ(DMA1_Channel4_IRQn);
#else
    NVIC_SetPriority(DMA0_Channel4_IRQn, 1);
    NVIC_EnableIRQ(DMA0_Channel4_IRQn);
#endif
#endif /* DMX_USE_UART3 */
#if defined(DMX_USE_UART4)
    /*
     * UART 4 TX
     */
    dma_deinit(UART4_DMAx, UART4_TX_DMA_CHx);
#if defined(GD32H7XX)
    dma_init_struct.request = DMA_REQUEST_UART4_TX;
#endif
    dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
#else
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
#if defined(GD32H7XX)
    dma_init_struct.periph_addr = (uint32_t)&USART_TDATA(UART4);
#else
    dma_init_struct.periph_addr = UART4 + 0x04U;
#endif
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
    dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init(UART4_DMAx, UART4_TX_DMA_CHx, &dma_init_struct);
    /* configure DMA mode */
    dma_circulation_disable(UART4_DMAx, UART4_TX_DMA_CHx);
    dma_memory_to_memory_disable(UART4_DMAx, UART4_TX_DMA_CHx);
#if defined(GD32F4XX)
    dma_channel_subperipheral_select(UART4_DMAx, UART4_TX_DMA_CHx, UART4_TX_DMA_SUBPERIx);
#endif
    Gd32DmaInterruptDisable<UART4_DMAx, UART4_TX_DMA_CHx, DMA_INTERRUPT_DISABLE>();
#if !defined(GD32F4XX)
    NVIC_SetPriority(DMA1_Channel3_IRQn, 1);
    NVIC_EnableIRQ(DMA1_Channel3_IRQn);
#else
    NVIC_SetPriority(DMA0_Channel7_IRQn, 1);
    NVIC_EnableIRQ(DMA0_Channel7_IRQn);
#endif
#endif /* DMX_USE_UART4 */
#if defined(DMX_USE_USART5)
    /*
     * USART 5 TX
     */
    dma_deinit(USART5_DMAx, USART5_TX_DMA_CHx);
#if defined(GD32H7XX)
    dma_init_struct.request = DMA_REQUEST_USART5_TX;
#endif
    dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if defined(GD32F20X)
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
#if defined(GD32H7XX)
    dma_init_struct.periph_addr = (uint32_t)&USART_TDATA(USART5);
#else
    dma_init_struct.periph_addr = USART5 + 0x04U;
#endif
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if defined(GD32F20X)
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
    dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init(USART5_DMAx, USART5_TX_DMA_CHx, &dma_init_struct);
    /* configure DMA mode */
    dma_circulation_disable(USART5_DMAx, USART5_TX_DMA_CHx);
    dma_memory_to_memory_disable(USART5_DMAx, USART5_TX_DMA_CHx);
#if defined(GD32F4XX)
    dma_channel_subperipheral_select(USART5_DMAx, USART5_TX_DMA_CHx, USART5_TX_DMA_SUBPERIx);
#endif
    Gd32DmaInterruptDisable<USART5_DMAx, USART5_TX_DMA_CHx, DMA_INTERRUPT_DISABLE>();
    NVIC_SetPriority(DMA1_Channel6_IRQn, 1);
    NVIC_EnableIRQ(DMA1_Channel6_IRQn);
#endif /* DMX_USE_USART5 */
#if defined(DMX_USE_UART6)
    /*
     * UART 6 TX
     */
    dma_deinit(UART6_DMAx, UART6_TX_DMA_CHx);
#if defined(GD32H7XX)
    dma_init_struct.request = DMA_REQUEST_UART6_TX;
#endif
    dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if defined(GD32F20X)
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
#if defined(GD32H7XX)
    dma_init_struct.periph_addr = (uint32_t)&USART_TDATA(UART6);
#else
    dma_init_struct.periph_addr = UART6 + 0x04U;
#endif
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if defined(GD32F20X)
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
    dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init(UART6_DMAx, UART6_TX_DMA_CHx, &dma_init_struct);
    /* configure DMA mode */
    dma_circulation_disable(UART6_DMAx, UART6_TX_DMA_CHx);
    dma_memory_to_memory_disable(UART6_DMAx, UART6_TX_DMA_CHx);
#if defined(GD32F4XX)
    dma_channel_subperipheral_select(UART6_DMAx, UART6_TX_DMA_CHx, UART6_TX_DMA_SUBPERIx);
#endif
    Gd32DmaInterruptDisable<UART6_DMAx, UART4_TX_DMA_CHx, DMA_INTERRUPT_DISABLE>();
#if defined(GD32F20X)
    NVIC_SetPriority(DMA1_Channel4_IRQn, 1);
    NVIC_EnableIRQ(DMA1_Channel4_IRQn);
#else
    NVIC_SetPriority(DMA0_Channel1_IRQn, 1);
    NVIC_EnableIRQ(DMA0_Channel1_IRQn);
#endif
#endif /* DMX_USE_UART6 */
#if defined(DMX_USE_UART7)
    /*
     * UART 7 TX
     */
    dma_deinit(UART7_DMAx, UART7_TX_DMA_CHx);
#if defined(GD32H7XX)
    dma_init_struct.request = DMA_REQUEST_UART7_TX;
#endif
    dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if defined(GD32F20X)
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
#if defined(GD32H7XX)
    dma_init_struct.periph_addr = (uint32_t)&USART_TDATA(UART7);
#else
    dma_init_struct.periph_addr = UART7 + 0x04U;
#endif
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if defined(GD32F20X)
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
    dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init(UART7_DMAx, UART7_TX_DMA_CHx, &dma_init_struct);
    /* configure DMA mode */
    dma_circulation_disable(UART7_DMAx, UART7_TX_DMA_CHx);
    dma_memory_to_memory_disable(UART7_DMAx, UART7_TX_DMA_CHx);
#if defined(GD32F4XX)
    dma_channel_subperipheral_select(UART7_DMAx, UART7_TX_DMA_CHx, UART7_TX_DMA_SUBPERIx);
#endif
#if defined(GD32F20X)
    NVIC_SetPriority(DMA1_Channel3_IRQn, 1);
    NVIC_EnableIRQ(DMA1_Channel3_IRQn);
#else
    NVIC_SetPriority(DMA0_Channel0_IRQn, 1);
    NVIC_EnableIRQ(DMA0_Channel0_IRQn);
#endif
#endif /* DMX_USE_UART7 */
}

template <uint32_t UsartPeripheral, uint32_t DmaController, dma_channel_enum DmaChannel, typename TxBufferType> void DmaRestartTx(TxBufferType& tx_buffer)
{
    if (tx_buffer.dmx.read_index != tx_buffer.dmx.write_index)
    {
        tx_buffer.dmx.read_index ^= 1;
    }

    const auto* p = &tx_buffer.dmx.data[tx_buffer.dmx.read_index];

    auto dma_chctl = DMA_CHCTL(DmaController, DmaChannel);

    // Disable channel
    dma_chctl &= ~DMA_CHXCTL_CHEN;
    DMA_CHCTL(DmaController, DmaChannel) = dma_chctl;

    // Clear transfer complete interrupt
    Gd32DmaInterruptFlagClear<DmaController, DmaChannel, DMA_INTF_FTFIF>();

