vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
    // Configure transfer
    DMA_CHMADDR(DmaController, DmaChannel) = reinterpret_cast<uint32_t>(p->data);
    DMA_CHCNT(DmaController, DmaChannel) = (p->length & DMA_CHXCNT_CNT);

    // Re-enable channel and interrupt
    dma_chctl |= DMA_CHXCTL_CHEN | DMA_INTERRUPT_ENABLE;
    DMA_CHCTL(DmaController, DmaChannel) = dma_chctl;

    // Enable USART DMA transmission
    USART_CTL2(UsartPeripheral) |= USART_TRANSMIT_DMA_ENABLE;
}

#define DMA_RESTART_TX(PORT_INDEX, USARTx, DMAx, CHx) DmaRestartTx<USARTx, DMAx, CHx>(s_TxBuffer[PORT_INDEX])

extern "C"
{
    void TIMER1_IRQHandler()
    {
        /*
         * USART 0
         */
#if defined(DMX_USE_USART0)
        if ((TIMER_INTF(TIMER1) & TIMER_INT_FLAG_CH0) == TIMER_INT_FLAG_CH0)
        {
            switch (s_TxBuffer[dmx::config::USART0_PORT].State)
            {
                case dmx::TxRxState::kDmxinter:
                    Gd32GpioModeOutput<USART0_GPIOx, USART0_TX_GPIO_PINx>();
                    GPIO_BC(USART0_GPIOx) = USART0_TX_GPIO_PINx;
                    s_TxBuffer[dmx::config::USART0_PORT].State = dmx::TxRxState::kBreak;
                    TIMER_CH0CV(TIMER1) = TIMER_CNT(TIMER1) + s_nDmxTransmit.break_time;
                    break;
                case dmx::TxRxState::kBreak:
                    Gd32GpioModeAf<USART0_GPIOx, USART0_TX_GPIO_PINx, USART0>();
                    s_TxBuffer[dmx::config::USART0_PORT].State = dmx::TxRxState::kMab;
                    TIMER_CH0CV(TIMER1) = TIMER_CNT(TIMER1) + s_nDmxTransmit.mab_time;
                    break;
                case dmx::TxRxState::kMab:
                {
                    DMA_RESTART_TX(dmx::config::USART0_PORT, USART0, USART0_DMAx, USART0_TX_DMA_CHx);
                }
                break;
                default:
                    [[unlikely]] break;
            }

            TIMER_INTF(TIMER1) = static_cast<uint32_t>(~TIMER_INT_FLAG_CH0);
        }
#endif
        /*
         * USART 1
         */
#if defined(DMX_USE_USART1)
        if ((TIMER_INTF(TIMER1) & TIMER_INT_FLAG_CH1) == TIMER_INT_FLAG_CH1)
        {
            switch (s_TxBuffer[dmx::config::USART1_PORT].State)
            {
                case dmx::TxRxState::kDmxinter:
                    Gd32GpioModeOutput<USART1_GPIOx, USART1_TX_GPIO_PINx>();
                    GPIO_BC(USART1_GPIOx) = USART1_TX_GPIO_PINx;
                    s_TxBuffer[dmx::config::USART1_PORT].State = dmx::TxRxState::kBreak;
                    TIMER_CH1CV(TIMER1) = TIMER_CNT(TIMER1) + s_nDmxTransmit.break_time;
                    break;
                case dmx::TxRxState::kBreak:
                    Gd32GpioModeAf<USART1_GPIOx, USART1_TX_GPIO_PINx, USART1>();
                    s_TxBuffer[dmx::config::USART1_PORT].State = dmx::TxRxState::kMab;
                    TIMER_CH1CV(TIMER1) = TIMER_CNT(TIMER1) + s_nDmxTransmit.mab_time;
                    break;
                case dmx::TxRxState::kMab:
                {
                    DMA_RESTART_TX(dmx::config::USART1_PORT, USART1, USART1_DMAx, USART1_TX_DMA_CHx);
                }
                break;
                default:
                    [[unlikely]] break;
            }

            TIMER_INTF(TIMER1) = static_cast<uint32_t>(~TIMER_INT_FLAG_CH1);
        }
#endif
        /*
         * USART 2
         */
#if defined(DMX_USE_USART2)
        if ((TIMER_INTF(TIMER1) & TIMER_INT_FLAG_CH2) == TIMER_INT_FLAG_CH2)
        {
            switch (s_TxBuffer[dmx::config::USART2_PORT].State)
            {
                case dmx::TxRxState::kDmxinter:
                    Gd32GpioModeOutput<USART2_GPIOx, USART2_TX_GPIO_PINx>();
                    GPIO_BC(USART2_GPIOx) = USART2_TX_GPIO_PINx;
                    s_TxBuffer[dmx::config::USART2_PORT].State = dmx::TxRxState::kBreak;
                    TIMER_CH2CV(TIMER1) = TIMER_CNT(TIMER1) + s_nDmxTransmit.break_time;
                    break;
                case dmx::TxRxState::kBreak:
                    Gd32GpioModeAf<USART2_GPIOx, USART2_TX_GPIO_PINx, USART2>();
                    s_TxBuffer[dmx::config::USART2_PORT].State = dmx::TxRxState::kMab;
                    TIMER_CH2CV(TIMER1) = TIMER_CNT(TIMER1) + s_nDmxTransmit.mab_time;
                    break;
                case dmx::TxRxState::kMab:
                {
                    DMA_RESTART_TX(dmx::config::USART2_PORT, USART2, USART2_DMAx, USART2_TX_DMA_CHx);
                }
                break;
                default:
                    [[unlikely]] break;
            }

            TIMER_INTF(TIMER1) = static_cast<uint32_t>(~TIMER_INT_FLAG_CH2);
        }
#endif
        /*
         * UART 3
         */
#if defined(DMX_USE_UART3)
        if ((TIMER_INTF(TIMER1) & TIMER_INT_FLAG_CH3) == TIMER_INT_FLAG_CH3)
        {
            switch (s_TxBuffer[dmx::config::UART3_PORT].State)
            {
                case dmx::TxRxState::kDmxinter:
                    Gd32GpioModeOutput<UART3_GPIOx, UART3_TX_GPIO_PINx>();
                    GPIO_BC(UART3_GPIOx) = UART3_TX_GPIO_PINx;
                    s_TxBuffer[dmx::config::UART3_PORT].State = dmx::TxRxState::kBreak;
                    TIMER_CH3CV(TIMER1) = TIMER_CNT(TIMER1) + s_nDmxTransmit.break_time;
                    break;
                case dmx::TxRxState::kBreak:
                    Gd32GpioModeAf<UART3_GPIOx, UART3_TX_GPIO_PINx, UART3>();
                    s_TxBuffer[dmx::config::UART3_PORT].State = dmx::TxRxState::kMab;
                    TIMER_CH3CV(TIMER1) = TIMER_CNT(TIMER1) + s_nDmxTransmit.mab_time;
                    break;
                case dmx::TxRxState::kMab:
                {
                    DMA_RESTART_TX(dmx::config::UART3_PORT, UART3, UART3_DMAx, UART3_TX_DMA_CHx);
                }
                break;
                default:
                    [[unlikely]] break;
            }

            TIMER_INTF(TIMER1) = static_cast<uint32_t>(~TIMER_INT_FLAG_CH3);
        }
#endif
        // Clear all remaining interrupt flags (safety measure)
        TIMER_INTF(TIMER1) = static_cast<uint32_t>(~0);
    }

    void TIMER4_IRQHandler()
    {
        /*
         * UART 4
         */
#if defined(DMX_USE_UART4)
        if ((TIMER_INTF(TIMER4) & TIMER_INT_FLAG_CH0) == TIMER_INT_FLAG_CH0)
        {
            switch (s_TxBuffer[dmx::config::UART4_PORT].State)
            {
                case dmx::TxRxState::kDmxinter:
                    Gd32GpioModeOutput<UART4_TX_GPIOx, UART4_TX_GPIO_PINx>();
                    GPIO_BC(UART4_TX_GPIOx) = UART4_TX_GPIO_PINx;
                    s_TxBuffer[dmx::config::UART4_PORT].State = dmx::TxRxState::kBreak;
                    TIMER_CH0CV(TIMER4) = TIMER_CNT(TIMER4) + s_nDmxTransmit.break_time;
                    break;
                case dmx::TxRxState::kBreak:
                    Gd32GpioModeAf<UART4_TX_GPIOx, UART4_TX_GPIO_PINx, UART4>();
                    s_TxBuffer[dmx::config::UART4_PORT].State = dmx::TxRxState::kMab;
                    TIMER_CH0CV(TIMER4) = TIMER_CNT(TIMER4) + s_nDmxTransmit.mab_time;
                    break;
                case dmx::TxRxState::kMab:
                {
                    DMA_RESTART_TX(dmx::config::UART4_PORT, UART4, UART4_DMAx, UART4_TX_DMA_CHx);
                }
                break;
                default:
                    break;
            }

