vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
            TIMER_INTF(TIMER4) = static_cast<uint32_t>(~TIMER_INT_FLAG_CH0);
        }
#endif
        /*
         * USART 5
         */
#if defined(DMX_USE_USART5)
        if ((TIMER_INTF(TIMER4) & TIMER_INT_FLAG_CH1) == TIMER_INT_FLAG_CH1)
        {
            switch (s_TxBuffer[dmx::config::USART5_PORT].State)
            {
                case dmx::TxRxState::kDmxinter:
                    Gd32GpioModeOutput<USART5_GPIOx, USART5_TX_GPIO_PINx>();
                    GPIO_BC(USART5_GPIOx) = USART5_TX_GPIO_PINx;
                    s_TxBuffer[dmx::config::USART5_PORT].State = dmx::TxRxState::kBreak;
                    TIMER_CH1CV(TIMER4) = TIMER_CNT(TIMER4) + s_nDmxTransmit.break_time;
                    break;
                case dmx::TxRxState::kBreak:
                    Gd32GpioModeAf<USART5_GPIOx, USART5_TX_GPIO_PINx, USART5>();
                    s_TxBuffer[dmx::config::USART5_PORT].State = dmx::TxRxState::kMab;
                    TIMER_CH1CV(TIMER4) = TIMER_CNT(TIMER4) + s_nDmxTransmit.mab_time;
                    break;
                case dmx::TxRxState::kMab:
                {
                    DMA_RESTART_TX(dmx::config::USART5_PORT, USART5, USART5_DMAx, USART5_TX_DMA_CHx);
                }
                break;
                default:
                    break;
            }

            TIMER_INTF(TIMER4) = static_cast<uint32_t>(~TIMER_INT_FLAG_CH1);
        }
#endif
        /*
         * UART 6
         */
#if defined(DMX_USE_UART6)
        if ((TIMER_INTF(TIMER4) & TIMER_INT_FLAG_CH2) == TIMER_INT_FLAG_CH2)
        {
            switch (s_TxBuffer[dmx::config::UART6_PORT].State)
            {
                case dmx::TxRxState::kDmxinter:
                    Gd32GpioModeOutput<UART6_GPIOx, UART6_TX_GPIO_PINx>();
                    GPIO_BC(UART6_GPIOx) = UART6_TX_GPIO_PINx;
                    s_TxBuffer[dmx::config::UART6_PORT].State = dmx::TxRxState::kBreak;
                    TIMER_CH2CV(TIMER4) = TIMER_CNT(TIMER4) + s_nDmxTransmit.break_time;
                    break;
                case dmx::TxRxState::kBreak:
                    Gd32GpioModeAf<UART6_GPIOx, UART6_TX_GPIO_PINx, UART6>();
                    s_TxBuffer[dmx::config::UART6_PORT].State = dmx::TxRxState::kMab;
                    TIMER_CH2CV(TIMER4) = TIMER_CNT(TIMER4) + s_nDmxTransmit.mab_time;
                    break;
                case dmx::TxRxState::kMab:
                {
                    DMA_RESTART_TX(dmx::config::UART6_PORT, UART6, UART6_DMAx, UART6_TX_DMA_CHx);
                }
                break;
                default:
                    break;
            }

            TIMER_INTF(TIMER4) = static_cast<uint32_t>(~TIMER_INT_FLAG_CH2);
        }
#endif
        /*
         * UART 7
         */
#if defined(DMX_USE_UART7)
        if ((TIMER_INTF(TIMER4) & TIMER_INT_FLAG_CH3) == TIMER_INT_FLAG_CH3)
        {
            switch (s_TxBuffer[dmx::config::UART7_PORT].State)
            {
                case dmx::TxRxState::kDmxinter:
                    Gd32GpioModeOutput<UART7_GPIOx, UART7_TX_GPIO_PINx>();
                    GPIO_BC(UART7_GPIOx) = UART7_TX_GPIO_PINx;
                    s_TxBuffer[dmx::config::UART7_PORT].State = dmx::TxRxState::kBreak;
                    TIMER_CH3CV(TIMER4) = TIMER_CNT(TIMER4) + s_nDmxTransmit.break_time;
                    break;
                case dmx::TxRxState::kBreak:
                    Gd32GpioModeAf<UART7_GPIOx, UART7_TX_GPIO_PINx, UART7>();
                    s_TxBuffer[dmx::config::UART7_PORT].State = dmx::TxRxState::kMab;
                    TIMER_CH3CV(TIMER4) = TIMER_CNT(TIMER4) + s_nDmxTransmit.mab_time;
                    break;
                case dmx::TxRxState::kMab:
                {
                    DMA_RESTART_TX(dmx::config::UART7_PORT, UART7, UART7_DMAx, UART7_TX_DMA_CHx);
                }
                break;
                default:
                    break;
            }

            TIMER_INTF(TIMER4) = static_cast<uint32_t>(~TIMER_INT_FLAG_CH3);
        }
#endif
        // Clear all remaining interrupt flags (safety measure)
        TIMER_INTF(TIMER4) = static_cast<uint32_t>(~0);
    }

    void TIMER6_IRQHandler()
    {
        const auto kIntFlag = TIMER_INTF(TIMER6);

        if ((kIntFlag & TIMER_INT_FLAG_UP) == TIMER_INT_FLAG_UP)
        {
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
            for (uint32_t i = 0; i < DMX_MAX_PORTS; i++)
            {
                auto& packet = sv_nRxDmxPackets[i];
                packet.per_second = packet.count - packet.count_previous;
                packet.count_previous = packet.count;
            }
#endif
            g_Seconds.nUptime = g_Seconds.nUptime + 1;
        }

        // Clear all remaining interrupt flags (safety measure)
        TIMER_INTF(TIMER6) = static_cast<uint32_t>(~kIntFlag);
    }
}

extern "C"
{
/*
 * USART 0
 */
#if defined(DMX_USE_USART0)
#if defined(GD32F4XX) || defined(GD32H7XX)
    void DMA1_Channel7_IRQHandler()
    {
        if (Gd32DmaInterruptFlagGet<DMA1, DMA_CH7, DMA_INTERRUPT_FLAG_GET>())
        {
            Gd32DmaInterruptDisable<DMA1, DMA_CH7, DMA_INTERRUPT_DISABLE>();

            if (s_TxBuffer[dmx::config::USART0_PORT].output_style == dmx::OutputStyle::kDelta)
            {
                s_TxBuffer[dmx::config::USART0_PORT].State = dmx::TxRxState::kIdle;
            }
            else
            {
                timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_0, TIMER_CNT(TIMER1) + s_nDmxTransmit.inter_time);
                s_TxBuffer[dmx::config::USART0_PORT].State = dmx::TxRxState::kDmxinter;
            }

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            sv_TotalStatistics[dmx::config::USART0_PORT].dmx.sent++;
#endif
        }

        Gd32DmaInterruptFlagClear<DMA1, DMA_CH7, DMA_INTERRUPT_FLAG_CLEAR>();
    }
#else
    void DMA0_Channel3_IRQHandler()
    {
        if (Gd32DmaInterruptFlagGet<DMA0, DMA_CH3, DMA_INTERRUPT_FLAG_GET>())
        {
            Gd32DmaInterruptDisable<DMA0, DMA_CH3, DMA_INTERRUPT_DISABLE>();

            if (s_TxBuffer[dmx::config::USART0_PORT].output_style == dmx::OutputStyle::kDelta)
            {
                s_TxBuffer[dmx::config::USART0_PORT].State = dmx::TxRxState::kIdle;
            }
            else
            {
                timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_0, TIMER_CNT(TIMER1) + s_nDmxTransmit.inter_time);
                s_TxBuffer[dmx::config::USART0_PORT].State = dmx::TxRxState::kDmxinter;
            }

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            sv_TotalStatistics[dmx::config::USART0_PORT].dmx.sent++;
#endif
        }

        Gd32DmaInterruptFlagClear<DMA0, DMA_CH3, DMA_INTERRUPT_FLAG_CLEAR>();
    }
#endif
#endif
/*
 * USART 1
 */
#if defined(DMX_USE_USART1)
    void DMA0_Channel6_IRQHandler()
    {
        if (Gd32DmaInterruptFlagGet<DMA0, DMA_CH6, DMA_INTERRUPT_FLAG_GET>())
        {
            Gd32DmaInterruptDisable<DMA0, DMA_CH6, DMA_INTERRUPT_DISABLE>();

