vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
            if (s_TxBuffer[dmx::config::USART1_PORT].output_style == dmx::OutputStyle::kDelta)
            {
                s_TxBuffer[dmx::config::USART1_PORT].State = dmx::TxRxState::kIdle;
            }
            else
            {
                timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_1, TIMER_CNT(TIMER1) + s_nDmxTransmit.inter_time);
                s_TxBuffer[dmx::config::USART1_PORT].State = dmx::TxRxState::kDmxinter;
            }

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            sv_TotalStatistics[dmx::config::USART1_PORT].dmx.sent++;
#endif
        }

        Gd32DmaInterruptFlagClear<DMA0, DMA_CH6, DMA_INTERRUPT_FLAG_CLEAR>();
    }
#endif
/*
 * USART 2
 */
#if defined(DMX_USE_USART2)
#if defined(GD32F4XX) || defined(GD32H7XX)
    void DMA0_Channel3_IRQHandler()
    {
        if (Gd32DmaInterruptFlagGet<DMA0, DMA_CH3, DMA_INTERRUPT_FLAG_GET>())
        {
            Gd32DmaInterruptDisable<DMA0, DMA_CH3, DMA_INTERRUPT_DISABLE>();

            if (s_TxBuffer[dmx::config::USART2_PORT].output_style == dmx::OutputStyle::kDelta)
            {
                s_TxBuffer[dmx::config::USART2_PORT].State = dmx::TxRxState::kIdle;
            }
            else
            {
                timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_2, TIMER_CNT(TIMER1) + s_nDmxTransmit.inter_time);
                s_TxBuffer[dmx::config::USART2_PORT].State = dmx::TxRxState::kDmxinter;
            }

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            sv_TotalStatistics[dmx::config::USART2_PORT].dmx.sent++;
#endif
        }

        Gd32DmaInterruptFlagClear<DMA0, DMA_CH3, DMA_INTERRUPT_FLAG_CLEAR>();
    }
#else
    void DMA0_Channel1_IRQHandler()
    {
        if (Gd32DmaInterruptFlagGet<DMA0, DMA_CH1, DMA_INTERRUPT_FLAG_GET>())
        {
            Gd32DmaInterruptDisable<DMA0, DMA_CH1, DMA_INTERRUPT_DISABLE>();

            if (s_TxBuffer[dmx::config::USART2_PORT].output_style == dmx::OutputStyle::kDelta)
            {
                s_TxBuffer[dmx::config::USART2_PORT].State = dmx::TxRxState::kIdle;
            }
            else
            {
                timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_2, TIMER_CNT(TIMER1) + s_nDmxTransmit.inter_time);
                s_TxBuffer[dmx::config::USART2_PORT].State = dmx::TxRxState::kDmxinter;
            }

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            sv_TotalStatistics[dmx::config::USART2_PORT].dmx.sent++;
#endif
        }

        Gd32DmaInterruptFlagClear<DMA0, DMA_CH1, DMA_INTERRUPT_FLAG_CLEAR>();
    }
#endif
#endif
/*
 * UART 3
 */
#if defined(DMX_USE_UART3)
#if defined(GD32F4XX) || defined(GD32H7XX)
    void DMA0_Channel4_IRQHandler()
    {
        if (Gd32DmaInterruptFlagGet<DMA0, DMA_CH4, DMA_INTERRUPT_FLAG_GET>())
        {
            Gd32DmaInterruptDisable<DMA0, DMA_CH4, DMA_INTERRUPT_DISABLE>();

            if (s_TxBuffer[dmx::config::UART3_PORT].output_style == dmx::OutputStyle::kDelta)
            {
                s_TxBuffer[dmx::config::UART3_PORT].State = dmx::TxRxState::kIdle;
            }
            else
            {
                timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_3, TIMER_CNT(TIMER1) + s_nDmxTransmit.inter_time);
                s_TxBuffer[dmx::config::UART3_PORT].State = dmx::TxRxState::kDmxinter;
            }

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            sv_TotalStatistics[dmx::config::UART3_PORT].dmx.sent++;
#endif
        }

        Gd32DmaInterruptFlagClear<DMA0, DMA_CH4, DMA_INTERRUPT_FLAG_CLEAR>();
    }
#else
    void DMA1_Channel4_IRQHandler()
    {
        if (Gd32DmaInterruptFlagGet<DMA1, DMA_CH4, DMA_INTERRUPT_FLAG_GET>())
        {
            Gd32DmaInterruptDisable<DMA1, DMA_CH4, DMA_INTERRUPT_DISABLE>();

            if (s_TxBuffer[dmx::config::UART3_PORT].output_style == dmx::OutputStyle::kDelta)
            {
                s_TxBuffer[dmx::config::UART3_PORT].State = dmx::TxRxState::kIdle;
            }
            else
            {
                timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_3, TIMER_CNT(TIMER1) + s_nDmxTransmit.inter_time);
                s_TxBuffer[dmx::config::UART3_PORT].State = dmx::TxRxState::kDmxinter;
            }

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            sv_TotalStatistics[dmx::config::UART3_PORT].dmx.sent++;
#endif
        }

        Gd32DmaInterruptFlagClear<DMA1, DMA_CH4, DMA_INTERRUPT_FLAG_CLEAR>();
    }
#endif
#endif
/*
 * UART 4
 */
#if defined(DMX_USE_UART4)
#if defined(GD32F20X)
    void DMA1_Channel3_IRQHandler()
    {
        if (Gd32DmaInterruptFlagGet<DMA1, DMA_CH3, DMA_INTERRUPT_FLAG_GET>())
        {
            Gd32DmaInterruptDisable<DMA1, DMA_CH3, DMA_INTERRUPT_DISABLE>();

            if (s_TxBuffer[dmx::config::UART4_PORT].output_style == dmx::OutputStyle::kDelta)
            {
                s_TxBuffer[dmx::config::UART4_PORT].State = dmx::TxRxState::kIdle;
            }
            else
            {
                timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_0, TIMER_CNT(TIMER4) + s_nDmxTransmit.inter_time);
                s_TxBuffer[dmx::config::UART4_PORT].State = dmx::TxRxState::kDmxinter;
            }

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            sv_TotalStatistics[dmx::config::UART4_PORT].dmx.sent++;
#endif
        }

        Gd32DmaInterruptFlagClear<DMA1, DMA_CH3, DMA_INTERRUPT_FLAG_CLEAR>();
    }
#endif
#if defined(GD32F4XX) || defined(GD32H7XX)
    void DMA0_Channel7_IRQHandler()
    {
        if (Gd32DmaInterruptFlagGet<DMA0, DMA_CH7, DMA_INTERRUPT_FLAG_GET>())
        {
            Gd32DmaInterruptDisable<DMA0, DMA_CH7, DMA_INTERRUPT_DISABLE>();

            if (s_TxBuffer[dmx::config::UART4_PORT].output_style == dmx::OutputStyle::kDelta)
            {
                s_TxBuffer[dmx::config::UART4_PORT].State = dmx::TxRxState::kIdle;
            }
            else
            {
                timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_0, TIMER_CNT(TIMER4) + s_nDmxTransmit.inter_time);
                s_TxBuffer[dmx::config::UART4_PORT].State = dmx::TxRxState::kDmxinter;
            }
        }

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
        sv_TotalStatistics[dmx::config::UART4_PORT].dmx.sent++;
#endif

        Gd32DmaInterruptFlagClear<DMA0, DMA_CH7, DMA_INTERRUPT_FLAG_CLEAR>();
    }
#endif
#endif
/*
 * USART 5
 */
#if defined(DMX_USE_USART5)
    void DMA1_Channel6_IRQHandler()
    {
        if (Gd32DmaInterruptFlagGet<DMA1, DMA_CH6, DMA_INTERRUPT_FLAG_GET>())
        {
            Gd32DmaInterruptDisable<DMA1, DMA_CH6, DMA_INTERRUPT_DISABLE>();

            if (s_TxBuffer[dmx::config::USART5_PORT].output_style == dmx::OutputStyle::kDelta)
            {
                s_TxBuffer[dmx::config::USART5_PORT].State = dmx::TxRxState::kIdle;
            }
            else
            {
                timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_1, TIMER_CNT(TIMER4) + s_nDmxTransmit.inter_time);
                s_TxBuffer[dmx::config::USART5_PORT].State = dmx::TxRxState::kDmxinter;
            }

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            sv_TotalStatistics[dmx::config::USART5_PORT].dmx.sent++;
#endif
        }

        Gd32DmaInterruptFlagClear<DMA1, DMA_CH6, DMA_INTERRUPT_FLAG_CLEAR>();
    }
#endif
/*
 * UART 6
 */
#if defined(DMX_USE_UART6)
#if defined(GD32F20X)
    void DMA1_Channel4_IRQHandler()
    {
        if (Gd32DmaInterruptFlagGet<DMA1, DMA_CH4, DMA_INTERRUPT_FLAG_GET>())
        {
            Gd32DmaInterruptDisable<DMA1, DMA_CH4, DMA_INTERRUPT_DISABLE>();

