vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
            if (s_TxBuffer[dmx::config::UART6_PORT].output_style == dmx::OutputStyle::kDelta)
            {
                s_TxBuffer[dmx::config::UART6_PORT].State = dmx::TxRxState::kIdle;
            }
            else
            {
                timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_2, TIMER_CNT(TIMER4) + s_nDmxTransmit.inter_time);
                s_TxBuffer[dmx::config::UART6_PORT].State = dmx::TxRxState::kDmxinter;
            }

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            sv_TotalStatistics[dmx::config::UART6_PORT].dmx.sent++;
#endif
        }

        Gd32DmaInterruptFlagClear<DMA1, DMA_CH4, DMA_INTERRUPT_FLAG_CLEAR>();
    }
#endif
#if defined(GD32F4XX) || defined(GD32H7XX)
    void DMA0_Channel1_IRQHandler()
    {
        if (Gd32DmaInterruptFlagGet<DMA0, DMA_CH1, DMA_INTERRUPT_FLAG_GET>())
        {
            Gd32DmaInterruptDisable<DMA0, DMA_CH1, DMA_INTERRUPT_DISABLE>();

            if (s_TxBuffer[dmx::config::UART6_PORT].output_style == dmx::OutputStyle::kDelta)
            {
                s_TxBuffer[dmx::config::UART6_PORT].State = dmx::TxRxState::kIdle;
            }
            else
            {
                timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_2, TIMER_CNT(TIMER4) + s_nDmxTransmit.inter_time);
                s_TxBuffer[dmx::config::UART6_PORT].State = dmx::TxRxState::kDmxinter;
            }

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            sv_TotalStatistics[dmx::config::UART6_PORT].dmx.sent++;
#endif
        }

        Gd32DmaInterruptFlagClear<DMA0, DMA_CH1, DMA_INTERRUPT_FLAG_CLEAR>();
    }
#endif
#endif
/*
 * UART 7
 */
#if defined(DMX_USE_UART7)
#if defined(GD32F20X)
    void DMA1_Channel3_IRQHandler()
    {
        if (Gd32DmaInterruptFlagGet<DMA1, DMA_CH3, DMA_INTERRUPT_FLAG_GET>())
        {
            Gd32DmaInterruptDisable<DMA1, DMA_CH3, DMA_INTERRUPT_DISABLE>();

            if (s_TxBuffer[dmx::config::UART7_PORT].output_style == dmx::OutputStyle::kDelta)
            {
                s_TxBuffer[dmx::config::UART7_PORT].State = dmx::TxRxState::kIdle;
            }
            else
            {
                timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_3, TIMER_CNT(TIMER4) + s_nDmxTransmit.inter_time);
                s_TxBuffer[dmx::config::UART7_PORT].State = dmx::TxRxState::kDmxinter;
            }

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            sv_TotalStatistics[dmx::config::UART7_PORT].dmx.sent++;
#endif
        }

        Gd32DmaInterruptFlagClear<DMA1, DMA_CH3, DMA_INTERRUPT_FLAG_CLEAR>();
    }
#endif
#if defined(GD32F4XX) || defined(GD32H7XX)
    void DMA0_Channel0_IRQHandler()
    {
        if (Gd32DmaInterruptFlagGet<DMA0, DMA_CH0, DMA_INTERRUPT_FLAG_GET>())
        {
            Gd32DmaInterruptDisable<DMA0, DMA_CH0, DMA_INTERRUPT_DISABLE>();

            if (s_TxBuffer[dmx::config::UART7_PORT].output_style == dmx::OutputStyle::kDelta)
            {
                s_TxBuffer[dmx::config::UART7_PORT].State = dmx::TxRxState::kIdle;
            }
            else
            {
                timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_3, TIMER_CNT(TIMER4) + s_nDmxTransmit.inter_time);
                s_TxBuffer[dmx::config::UART7_PORT].State = dmx::TxRxState::kDmxinter;
            }

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            sv_TotalStatistics[dmx::config::UART7_PORT].dmx.sent++;
#endif
        }

        Gd32DmaInterruptFlagClear<DMA0, DMA_CH0, DMA_INTERRUPT_FLAG_CLEAR>();
    }
#endif
#endif
}

static void UartDmxConfig(uint32_t usart_periph)
{
    Gd32UartBegin(usart_periph, 250000U, gd32::kUartBits8, gd32::kUartParityNone, gd32::kUartStop2Bits);
}

Dmx::Dmx()
{
    DEBUG_ENTRY();

    assert(s_this == nullptr);
    s_this = this;

    s_nDmxTransmit.break_time = dmx::transmit::kBreakTimeTypical;
    s_nDmxTransmit.mab_time = dmx::transmit::kBreakTimeMin;
    s_nDmxTransmit.inter_time = dmx::transmit::kPeriodDefault - s_nDmxTransmit.break_time - s_nDmxTransmit.mab_time - (dmx::kChannelsMax * 44) - 44;

    for (auto i = 0; i < DMX_MAX_PORTS; i++)
    {
#if defined(GPIO_INIT)
        gpio_init(kDirGpio[i].port, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, kDirGpio[i].pin);
#else
        gpio_mode_set(kDirGpio[i].port, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLDOWN, kDirGpio[i].pin);
        gpio_output_options_set(kDirGpio[i].port, GPIO_OTYPE_PP, GPIO_OSPEED, kDirGpio[i].pin);
#endif
        m_nDmxTransmissionLength[i] = dmx::kChannelsMax;
        SetPortDirection(i, dmx::PortDirection::kInput, false);
        sv_RxBuffer[i].State = dmx::TxRxState::kIdle;
        s_TxBuffer[i].State = dmx::TxRxState::kIdle;
        s_TxBuffer[i].output_style = dmx::OutputStyle::kDelta;
        ClearData(i);
    }

    UsartDmaConfig(); // DMX Transmit
#if defined(DMX_USE_USART0) || defined(DMX_USE_USART1) || defined(DMX_USE_USART2) || defined(DMX_USE_UART3)
    Timer1Config(); // DMX Transmit -> USART0, USART1, USART2, UART3
#endif
#if defined(DMX_USE_UART4) || defined(DMX_USE_USART5) || defined(DMX_USE_UART6) || defined(DMX_USE_UART7)
    timer4_config(); // DMX Transmit -> UART4, USART5, UART6, UART7
#endif

#if defined(DMX_USE_USART0)
    UartDmxConfig(USART0);
    NVIC_SetPriority(USART0_IRQn, 0);
    NVIC_EnableIRQ(USART0_IRQn);
#endif
#if defined(DMX_USE_USART1)
    UartDmxConfig(USART1);
    NVIC_SetPriority(USART1_IRQn, 0);
    NVIC_EnableIRQ(USART1_IRQn);
#endif
#if defined(DMX_USE_USART2)
    UartDmxConfig(USART2);
    NVIC_SetPriority(USART2_IRQn, 0);
    NVIC_EnableIRQ(USART2_IRQn);
#endif
#if defined(DMX_USE_UART3)
    UartDmxConfig(UART3);
    NVIC_SetPriority(UART3_IRQn, 0);
    NVIC_EnableIRQ(UART3_IRQn);
#endif
#if defined(DMX_USE_UART4)
    UartDmxConfig(UART4);
    NVIC_SetPriority(UART4_IRQn, 0);
    NVIC_EnableIRQ(UART4_IRQn);
#endif
#if defined(DMX_USE_USART5)
    UartDmxConfig(USART5);
    NVIC_SetPriority(USART5_IRQn, 0);
    NVIC_EnableIRQ(USART5_IRQn);
#endif
#if defined(DMX_USE_UART6)
    UartDmxConfig(UART6);
    NVIC_SetPriority(UART6_IRQn, 0);
    NVIC_EnableIRQ(UART6_IRQn);
#endif
#if defined(DMX_USE_UART7)
    UartDmxConfig(UART7);
    NVIC_SetPriority(UART7_IRQn, 0);
    NVIC_EnableIRQ(UART7_IRQn);
#endif

    DEBUG_EXIT();
}

void Dmx::SetPortDirection(uint32_t port_index, dmx::PortDirection port_direction, bool enable_data)
{
    DEBUG_PRINTF("port_index=%u", port_index);

    DMX_CHECK_PORT_INDEX_VOID(port_index);

    if (m_dmxPortDirection[port_index] != port_direction)
    {
        m_dmxPortDirection[port_index] = port_direction;

