vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
        StopData(port_index);

        if (port_direction == dmx::PortDirection::kOutput)
        {
            GPIO_BOP(kDirGpio[port_index].port) = kDirGpio[port_index].pin;
        }
        else if (port_direction == dmx::PortDirection::kInput)
        {
            GPIO_BC(kDirGpio[port_index].port) = kDirGpio[port_index].pin;
        }
        else
        {
            assert(0);
        }
    }
    else if (!enable_data)
    {
        StopData(port_index);
    }

    if (enable_data)
    {
        StartData(port_index);
    }
}

void Dmx::ClearData(uint32_t port_index)
{
    assert(port_index < dmx::config::max::PORTS);

    auto* p = &s_TxBuffer[port_index].dmx.data[0];
    p->length = 513; // Including START Code
    __builtin_memset(p->data, 0, dmx::buffer::SIZE);
}

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
volatile dmx::TotalStatistics& Dmx::GetTotalStatistics(uint32_t port_index)
{
    sv_TotalStatistics[port_index].dmx.received = sv_nRxDmxPackets[port_index].count;
    return sv_TotalStatistics[port_index];
}
#endif

template <uint32_t port_index, uint32_t nUart> static void StartDmxOutput()
{
    DEBUG_PRINTF("port_index=%u, nUart=%u", port_index, nUart);
    /*
     * USART_FLAG_TC is set after power on.
     * The flag is cleared by DMA interrupt when maximum slots - 1 are transmitted.
     */

    // TODO(a): Do we need a timeout just to be safe?
    while (SET != usart_flag_get(nUart, USART_FLAG_TC));

    switch (nUart)
    {
        /* TIMER 1 */
#if defined(DMX_USE_USART0)
        case USART0:
            Gd32GpioModeOutput<USART0_GPIOx, USART0_TX_GPIO_PINx>();
            GPIO_BC(USART0_GPIOx) = USART0_TX_GPIO_PINx;
            TIMER_CH0CV(TIMER1) = TIMER_CNT(TIMER1) + s_nDmxTransmit.break_time;
            s_TxBuffer[dmx::config::USART0_PORT].State = dmx::TxRxState::kBreak;
            return;
            break;
#endif
#if defined(DMX_USE_USART1)
        case USART1:
            Gd32GpioModeOutput<USART1_GPIOx, USART1_TX_GPIO_PINx>();
            GPIO_BC(USART1_GPIOx) = USART1_TX_GPIO_PINx;
            TIMER_CH1CV(TIMER1) = TIMER_CNT(TIMER1) + s_nDmxTransmit.break_time;
            s_TxBuffer[dmx::config::USART1_PORT].State = dmx::TxRxState::kBreak;
            return;
            break;
#endif
#if defined(DMX_USE_USART2)
        case USART2:
            Gd32GpioModeOutput<USART2_GPIOx, USART2_TX_GPIO_PINx>();
            GPIO_BC(USART2_GPIOx) = USART2_TX_GPIO_PINx;
            TIMER_CH2CV(TIMER1) = TIMER_CNT(TIMER1) + s_nDmxTransmit.break_time;
            s_TxBuffer[dmx::config::USART2_PORT].State = dmx::TxRxState::kBreak;
            return;
            break;
#endif
#if defined(DMX_USE_UART3)
        case UART3:
            Gd32GpioModeOutput<UART3_GPIOx, UART3_TX_GPIO_PINx>();
            GPIO_BC(UART3_GPIOx) = UART3_TX_GPIO_PINx;
            TIMER_CH3CV(TIMER1) = TIMER_CNT(TIMER1) + s_nDmxTransmit.break_time;
            s_TxBuffer[dmx::config::UART3_PORT].State = dmx::TxRxState::kBreak;
            return;
            break;
#endif
            /* TIMER 4 */
#if defined(DMX_USE_UART4)
        case UART4:
            Gd32GpioModeOutput<UART4_TX_GPIOx, UART4_TX_GPIO_PINx>();
            GPIO_BC(UART4_TX_GPIOx) = UART4_TX_GPIO_PINx;
            TIMER_CH0CV(TIMER4) = TIMER_CNT(TIMER4) + s_nDmxTransmit.break_time;
            s_TxBuffer[dmx::config::UART4_PORT].State = dmx::TxRxState::kBreak;
            return;
            break;
#endif
#if defined(DMX_USE_USART5)
        case USART5:
            Gd32GpioModeOutput<USART5_GPIOx, USART5_TX_GPIO_PINx>();
            GPIO_BC(USART5_GPIOx) = USART5_TX_GPIO_PINx;
            TIMER_CH1CV(TIMER4) = TIMER_CNT(TIMER4) + s_nDmxTransmit.break_time;
            s_TxBuffer[dmx::config::USART5_PORT].State = dmx::TxRxState::kBreak;
            return;
            break;
#endif
#if defined(DMX_USE_UART6)
        case UART6:
            Gd32GpioModeOutput<UART6_GPIOx, UART6_TX_GPIO_PINx>();
            GPIO_BC(UART6_GPIOx) = UART6_TX_GPIO_PINx;
            TIMER_CH2CV(TIMER4) = TIMER_CNT(TIMER4) + s_nDmxTransmit.break_time;
            s_TxBuffer[dmx::config::UART6_PORT].State = dmx::TxRxState::kBreak;
            return;
            break;
#endif
#if defined(DMX_USE_UART7)
        case UART7:
            Gd32GpioModeOutput<UART7_GPIOx, UART7_TX_GPIO_PINx>();
            GPIO_BC(UART7_GPIOx) = UART7_TX_GPIO_PINx;
            TIMER_CH3CV(TIMER4) = TIMER_CNT(TIMER4) + s_nDmxTransmit.break_time;
            s_TxBuffer[dmx::config::UART7_PORT].State = dmx::TxRxState::kBreak;
            return;
            break;
#endif
        default:
            [[unlikely]] assert(0);
            __builtin_unreachable();
            break;
    }

    assert(0);
    __builtin_unreachable();
}

template <uint32_t portIndex> static void StartDmxOutputPort()
{
    if constexpr (portIndex < dmx::config::max::PORTS)
    {
        StartDmxOutput<portIndex, DmxPortToUart(portIndex)>();
    }
}

void Dmx::StartDmxOutput(uint32_t port_index)
{
    assert(port_index < dmx::config::max::PORTS);

    switch (port_index)
    {
        case 0:
            StartDmxOutputPort<0>();
            break;
#if DMX_MAX_PORTS >= 2
        case 1:
            StartDmxOutputPort<1>();
            break;
#endif
#if DMX_MAX_PORTS >= 3
        case 2:
            StartDmxOutputPort<2>();
            break;
#endif
#if DMX_MAX_PORTS >= 4
        case 3:
            StartDmxOutputPort<3>();
            break;
#endif
#if DMX_MAX_PORTS >= 5
        case 4:
            StartDmxOutputPort<4>();
            break;
#endif
#if DMX_MAX_PORTS >= 6
        case 5:
            StartDmxOutputPort<5>();
            break;
#endif
#if DMX_MAX_PORTS >= 7
        case 6:
            StartDmxOutputPort<6>();
            break;
#endif
#if DMX_MAX_PORTS >= 8
        case 7:
            StartDmxOutputPort<7>();
            break;
#endif
        default:
            [[unlikely]] break;
    }
}

void Dmx::StopData(uint32_t port_index)
{
    DMX_CHECK_PORT_INDEX_VOID(port_index);

    if (sv_PortState[port_index] == dmx::PortState::kIdle)
    {
        return;
    }

    sv_PortState[port_index] = dmx::PortState::kIdle;

