vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
    const auto kUart = DmxPortToUart(port_index);

    if (m_dmxPortDirection[port_index] == dmx::PortDirection::kOutput)
    {
        do
        {
            if (s_TxBuffer[port_index].State == dmx::TxRxState::kDmxinter)
            {
                Gd32UsartFlagClear<USART_FLAG_TC>(kUart);
                do
                {
                    __DMB();
                } while (!Gd32UsartFlagGet<USART_FLAG_TC>(kUart));

                s_TxBuffer[port_index].State = dmx::TxRxState::kIdle;
            }
        } while (s_TxBuffer[port_index].State != dmx::TxRxState::kIdle);

        return;
    }

    if (m_dmxPortDirection[port_index] == dmx::PortDirection::kInput)
    {
        Gd32UsartInterruptDisable<USART_INT_RBNE>(kUart);
        Gd32UsartInterruptDisable<USART_INT_FLAG_IDLE>(kUart);
        sv_RxBuffer[port_index].State = dmx::TxRxState::kIdle;
        return;
    }

    assert(0);
    __builtin_unreachable();
}

// DMX Send

void Dmx::SetDmxBreakTime(uint32_t break_time)
{
    s_nDmxTransmit.break_time = std::max(dmx::transmit::kBreakTimeMin, break_time);
    SetDmxPeriodTime(m_nDmxTransmitPeriodRequested);
}

uint32_t Dmx::GetDmxBreakTime() const
{
    return s_nDmxTransmit.break_time;
}

void Dmx::SetDmxMabTime(uint32_t mab_time)
{
    s_nDmxTransmit.mab_time = std::max(dmx::transmit::kMabTimeMin, mab_time);
    SetDmxPeriodTime(m_nDmxTransmitPeriodRequested);
}

uint32_t Dmx::GetDmxMabTime() const
{
    return s_nDmxTransmit.mab_time;
}

void Dmx::SetDmxPeriodTime(uint32_t period)
{
    m_nDmxTransmitPeriodRequested = period;

    auto length_max = s_TxBuffer[0].dmx.data[0].length;

    for (uint32_t port_index = 1; port_index < dmx::config::max::PORTS; port_index++)
    {
        const auto kLength = s_TxBuffer[port_index].dmx.data[0].length;
        if (kLength > length_max)
        {
            length_max = kLength;
        }
    }

    auto package_length_micro_seconds = s_nDmxTransmit.break_time + s_nDmxTransmit.mab_time + (length_max * 44U);

    // The GD32F4xx/GD32H7XX Timer 1 has a 32-bit counter
#if defined(GD32F4XX) || defined(GD32H7XX)
#else
    if (package_length_micro_seconds > (static_cast<uint16_t>(~0) - 44U))
    {
        s_nDmxTransmit.break_time = std::min(dmx::transmit::kBreakTimeTypical, s_nDmxTransmit.break_time);
        s_nDmxTransmit.mab_time = dmx::transmit::kMabTimeMin;
        package_length_micro_seconds = s_nDmxTransmit.break_time + s_nDmxTransmit.mab_time + (length_max * 44U);
    }
#endif

    if (period != 0)
    {
        if (period < package_length_micro_seconds)
        {
            m_nDmxTransmitPeriod = std::max(dmx::transmit::kBreakToBreakTimeMin, package_length_micro_seconds + 44U);
        }
        else
        {
            m_nDmxTransmitPeriod = period;
        }
    }
    else
    {
        m_nDmxTransmitPeriod = std::max(dmx::transmit::kBreakToBreakTimeMin, package_length_micro_seconds + 44U);
    }

    s_nDmxTransmit.inter_time = m_nDmxTransmitPeriod - package_length_micro_seconds;

    DEBUG_PRINTF("period=%u, nLengthMax=%u, m_nDmxTransmitPeriod=%u, nPackageLengthMicroSeconds=%u -> s_nDmxTransmit.inter_time=%u", period, length_max, m_nDmxTransmitPeriod, package_length_micro_seconds, s_nDmxTransmit.inter_time);
}

void Dmx::SetDmxSlots(uint16_t slots)
{
    if ((slots >= 2) && (slots <= dmx::kChannelsMax))
    {
        m_nDmxTransmitSlots = slots;

        for (uint32_t i = 0; i < dmx::config::max::PORTS; i++)
        {
            m_nDmxTransmissionLength[i] = std::min(m_nDmxTransmissionLength[i], static_cast<uint32_t>(slots));
        }

        SetDmxPeriodTime(m_nDmxTransmitPeriodRequested);
    }
}

void Dmx::SetOutputStyle(uint32_t port_index, dmx::OutputStyle output_style)
{
    DMX_CHECK_PORT_INDEX_VOID(port_index);

    s_TxBuffer[port_index].output_style = output_style;

    if (output_style == dmx::OutputStyle::kConstant)
    {
        if (!m_bHasContinuosOutput)
        {
            m_bHasContinuosOutput = true;
            if (m_dmxPortDirection[port_index] == dmx::PortDirection::kOutput)
            {
                StartDmxOutput(port_index);
            }
            return;
        }

        for (uint32_t index = 0; index < dmx::config::max::PORTS; index++)
        {
            if ((s_TxBuffer[index].output_style == dmx::OutputStyle::kConstant) && (m_dmxPortDirection[index] == dmx::PortDirection::kOutput))
            {
                StopData(index);
            }
        }

        for (uint32_t index = 0; index < dmx::config::max::PORTS; index++)
        {
            if ((s_TxBuffer[index].output_style == dmx::OutputStyle::kConstant) && (m_dmxPortDirection[index] == dmx::PortDirection::kOutput))
            {
                StartDmxOutput(index);
            }
        }
    }
    else
    {
        m_bHasContinuosOutput = false;
        for (uint32_t index = 0; index < dmx::config::max::PORTS; index++)
        {
            if (s_TxBuffer[index].output_style == dmx::OutputStyle::kConstant)
            {
                m_bHasContinuosOutput = true;
                return;
            }
        }
    }
}

dmx::OutputStyle Dmx::GetOutputStyle(uint32_t port_index) const
{
    DMX_CHECK_PORT_INDEX_VOID(port_index);
    return s_TxBuffer[port_index].output_style;
}

template <uint32_t portIndex, bool hasStartCode, dmx::SendStyle dmxSendStyle> void Dmx::SetSendDataInternal(const uint8_t* data, uint32_t length)
{
    DMX_CHECK_PORT_INDEX_VOID(portIndex);

    auto& tx_buffer = s_TxBuffer[portIndex];
    const auto kHasDataPending = tx_buffer.dmx.read_index != tx_buffer.dmx.write_index;

    if (!kHasDataPending)
    {
        // No pending data — switch to the other buffer
        tx_buffer.dmx.write_index ^= 1;
    }

    const auto kWriteIndex = tx_buffer.dmx.write_index;

    auto* dst_data = tx_buffer.dmx.data[kWriteIndex].data;

    const auto kCappedLength = (length < m_nDmxTransmitSlots) ? length : m_nDmxTransmitSlots;
    tx_buffer.dmx.data[kWriteIndex].length = kCappedLength + 1;

    tx_buffer.dmx.data_pending = true;

    if constexpr (hasStartCode)
    {
        memcpy(dst_data, data, kCappedLength);
    }
    else
    {
        dst_data[0] = dmx::kStartCode;
        memcpy(&dst_data[1], data, kCappedLength);
    }

