vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
    if (kCappedLength != m_nDmxTransmissionLength[portIndex])
    {
        m_nDmxTransmissionLength[portIndex] = kCappedLength;
        SetDmxPeriodTime(m_nDmxTransmitPeriodRequested);
    }

    if constexpr (dmxSendStyle == dmx::SendStyle::kDirect)
    {
        StartOutput(portIndex);
    }
}

void Dmx::Blackout()
{
    DEBUG_ENTRY();

    for (uint32_t port_index = 0; port_index < DMX_MAX_PORTS; port_index++)
    {
        if (m_dmxPortDirection[port_index] == dmx::PortDirection::kOutput)
        {
            StopData(port_index);
            ClearData(port_index);
            StartData(port_index);
        }
    }

    DEBUG_EXIT();
}

void Dmx::FullOn()
{
    DEBUG_ENTRY();

    for (uint32_t port_index = 0; port_index < DMX_MAX_PORTS; port_index++)
    {
        if (m_dmxPortDirection[port_index] == dmx::PortDirection::kOutput)
        {
            StopData(port_index);

            auto* __restrict__ p = &s_TxBuffer[port_index].dmx.data[0];
            auto* p32 = reinterpret_cast<uint32_t*>(p->data);

            for (auto i = 0; i < dmx::buffer::SIZE / 4; i++)
            {
                *p32++ = UINT32_MAX;
            }

            p->data[0] = dmx::kStartCode;
            p->length = 513;

            StartData(port_index);
        }
    }

    DEBUG_EXIT();
}

void Dmx::StartOutput(uint32_t port_index)
{
    DMX_CHECK_PORT_INDEX_VOID(port_index);

    if ((sv_PortState[port_index] == dmx::PortState::kTx) && (s_TxBuffer[port_index].output_style == dmx::OutputStyle::kDelta) && (s_TxBuffer[port_index].State == dmx::TxRxState::kIdle))
    {
        StartDmxOutput(port_index);
    }
}

void Dmx::Sync()
{
    for (uint32_t port_index = 0; port_index < dmx::config::max::PORTS; port_index++)
    {
        auto& tx_buffer = s_TxBuffer[port_index];

        if (!tx_buffer.dmx.data_pending)
        {
            continue;
        }

        tx_buffer.dmx.data_pending = false;

        if (sv_PortState[port_index] == dmx::PortState::kTx)
        {
            if ((tx_buffer.output_style == dmx::OutputStyle::kDelta) && (tx_buffer.State == dmx::TxRxState::kIdle))
            {
                StartDmxOutput(port_index);
            }
        }
    }
}

void Dmx::StartData(uint32_t port_index)
{
    DEBUG_PRINTF("port_index=%u", port_index);
    DMX_CHECK_PORT_INDEX_VOID(port_index);
    assert(sv_PortState[port_index] == dmx::PortState::kIdle);

    if (m_dmxPortDirection[port_index] == dmx::PortDirection::kOutput)
    {
        sv_PortState[port_index] = dmx::PortState::kTx;
        return;
    }

    if (m_dmxPortDirection[port_index] == dmx::PortDirection::kInput)
    {
        sv_RxBuffer[port_index].State = dmx::TxRxState::kIdle;

        const auto kUart = DmxPortToUart(port_index);

        do
        {
            __DMB();
        } while (!Gd32UsartFlagGet<USART_FLAG_TBE>(kUart));

        Gd32UsartInterruptFlagClear<USART_INT_FLAG_RBNE>(kUart);
        Gd32UsartInterruptFlagClear<USART_INT_FLAG_IDLE>(kUart);
        Gd32UsartInterruptEnable<USART_INT_RBNE>(kUart);
        Gd32UsartInterruptEnable<USART_INT_FLAG_IDLE>(kUart);

        sv_PortState[port_index] = dmx::PortState::kRx;
        return;
    }

    assert(0);
    __builtin_unreachable();
}

// DMX Receive

const uint8_t* Dmx::GetDmxChanged(uint32_t port_index)
{
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
    const auto* __restrict__ p = GetDmxAvailable(port_index);

    if (p == nullptr)
    {
        return nullptr;
    }

#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
    auto& dmx_data_buffer = GetReadDmxDataBuffer(port_index);
    const auto* __restrict__ src32 = reinterpret_cast<const volatile uint32_t*>(dmx_data_buffer.data);
    auto* __restrict__ dst32 = reinterpret_cast<volatile uint32_t*>(sv_RxBuffer[port_index].dmx.previous.data);

    if (dmx_data_buffer.slots_in_packet != sv_RxBuffer[port_index].dmx.previous.slots_in_packet)
    {
        sv_RxBuffer[port_index].dmx.previous.slots_in_packet = dmx_data_buffer.slots_in_packet;

        for (size_t i = 0; i < dmx::buffer::SIZE / 4; ++i)
        {
            dst32[i] = src32[i];
        }

        return p;
    }
#else
    const auto* __restrict__ src32 = reinterpret_cast<const volatile uint32_t*>(sv_RxBuffer[port_index].dmx.current.data);
    auto* __restrict__ dst32 = reinterpret_cast<volatile uint32_t*>(sv_RxBuffer[port_index].dmx.previous.data);

    if (sv_RxBuffer[port_index].dmx.current.slots_in_packet != sv_RxBuffer[port_index].dmx.previous.slots_in_packet)
    {
        sv_RxBuffer[port_index].dmx.previous.slots_in_packet = sv_RxBuffer[port_index].dmx.current.slots_in_packet;

        for (size_t i = 0; i < dmx::buffer::SIZE / 4; ++i)
        {
            dst32[i] = src32[i];
        }

        return p;
    }
#endif

    bool is_changed = false;

    for (size_t i = 0; i < dmx::buffer::SIZE / 4; ++i)
    {
        const auto kSrcValue = src32[i];
        auto dst_value = dst32[i];

        if (kSrcValue != dst_value)
        {
            dst32[i] = kSrcValue;
            is_changed = true;
        }
    }

    return (is_changed ? p : nullptr);
#else
    return nullptr;
#endif
}

const uint8_t* Dmx::GetDmxAvailable([[maybe_unused]] uint32_t port_index)
{
    DMX_CHECK_PORT_INDEX_VOID(port_index);
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
    auto& dmx_data_buffer = GetReadDmxDataBuffer(port_index);

    auto slots_in_packet = dmx_data_buffer.slots_in_packet;

    if (!(slots_in_packet & dmx::kDmxSlotsCompleteFlag))
    {
        return nullptr;
    }

    slots_in_packet &= ~dmx::kDmxSlotsCompleteFlag;
    slots_in_packet--; // Remove SC from length
    dmx_data_buffer.slots_in_packet = slots_in_packet;

    return const_cast<const uint8_t*>(dmx_data_buffer.data);
#else
    auto slots_in_packet = sv_RxBuffer[port_index].dmx.current.slots_in_packet;

    if ((slots_in_packet & 0x8000) != 0x8000)
    {
        return nullptr;
    }

    slots_in_packet &= ~0x8000;
    slots_in_packet--; // Remove SC from length
    sv_RxBuffer[port_index].dmx.current.slots_in_packet = slots_in_packet;

