vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
    return const_cast<const uint8_t*>(sv_RxBuffer[port_index].dmx.current.data);
#endif
#else
    return nullptr;
#endif
}

const uint8_t* Dmx::GetDmxCurrentData(uint32_t port_index)
{
#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
    return const_cast<const uint8_t*>(GetReadDmxDataBuffer(port_index).data);
#else
    return const_cast<const uint8_t*>(sv_RxBuffer[port_index].dmx.current.data);
#endif
}

uint32_t Dmx::GetDmxUpdatesPerSecond([[maybe_unused]] uint32_t port_index)
{
    DMX_CHECK_PORT_INDEX_VOID(port_index);
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
    return sv_nRxDmxPackets[port_index].per_second;
#else
    return 0;
#endif
}

// RDM Send

template <uint32_t port_index, uint32_t nUart> static void RdmSendRawImpl(const uint8_t* const kData, uint32_t length)
{
    DMX_CHECK_PORT_INDEX_VOID(port_index);
    assert(kData != nullptr);
    assert(length != 0);

    switch (nUart)
    {
#if defined(DMX_USE_USART0)
        case USART0:
            Gd32GpioModeOutput<USART0_GPIOx, USART0_TX_GPIO_PINx>();
            GPIO_BC(USART0_GPIOx) = USART0_TX_GPIO_PINx;
            break;
#endif
#if defined(DMX_USE_USART1)
        case USART1:
            Gd32GpioModeOutput<USART1_GPIOx, USART1_TX_GPIO_PINx>();
            GPIO_BC(USART1_GPIOx) = USART1_TX_GPIO_PINx;
            break;
#endif
#if defined(DMX_USE_USART2)
        case USART2:
            Gd32GpioModeOutput<USART2_GPIOx, USART2_TX_GPIO_PINx>();
            GPIO_BC(USART2_GPIOx) = USART2_TX_GPIO_PINx;
            break;
#endif
#if defined(DMX_USE_UART3)
        case UART3:
            Gd32GpioModeOutput<UART3_GPIOx, UART3_TX_GPIO_PINx>();
            GPIO_BC(UART3_GPIOx) = UART3_TX_GPIO_PINx;
            break;
#endif
#if defined(DMX_USE_UART4)
        case UART4:
            Gd32GpioModeOutput<UART4_TX_GPIOx, UART4_TX_GPIO_PINx>();
            GPIO_BC(UART4_TX_GPIOx) = UART4_TX_GPIO_PINx;
            break;
#endif
#if defined(DMX_USE_USART5)
        case USART5:
            Gd32GpioModeOutput<USART5_GPIOx, USART5_TX_GPIO_PINx>();
            GPIO_BC(USART5_GPIOx) = USART5_TX_GPIO_PINx;
            break;
#endif
#if defined(DMX_USE_UART6)
        case UART6:
            Gd32GpioModeOutput<UART6_GPIOx, UART6_TX_GPIO_PINx>();
            GPIO_BC(UART6_GPIOx) = UART6_TX_GPIO_PINx;
            break;
#endif
#if defined(DMX_USE_UART7)
        case UART7:
            Gd32GpioModeOutput<UART7_GPIOx, UART7_TX_GPIO_PINx>();
            GPIO_BC(UART7_GPIOx) = UART7_TX_GPIO_PINx;
            break;
#endif
        default:
            [[unlikely]] assert(0);
            __builtin_unreachable();
            break;
    }

    TIMER_CNT(TIMER5) = 0;
    do
    {
        __DMB();
    } while (TIMER_CNT(TIMER5) < RDM_TRANSMIT_BREAK_TIME);

    switch (nUart)
    {
#if defined(DMX_USE_USART0)
        case USART0:
            Gd32GpioModeAf<USART0_GPIOx, USART0_TX_GPIO_PINx, USART0>();
            break;
#endif
#if defined(DMX_USE_USART1)
        case USART1:
            Gd32GpioModeAf<USART1_GPIOx, USART1_TX_GPIO_PINx, USART1>();
            break;
#endif
#if defined(DMX_USE_USART2)
        case USART2:
            Gd32GpioModeAf<USART2_GPIOx, USART2_TX_GPIO_PINx, USART2>();
            break;
#endif
#if defined(DMX_USE_UART3)
        case UART3:
            Gd32GpioModeAf<UART3_GPIOx, UART3_TX_GPIO_PINx, UART3>();
            break;
#endif
#if defined(DMX_USE_UART4)
        case UART4:
            Gd32GpioModeAf<UART4_TX_GPIOx, UART4_TX_GPIO_PINx, UART4>();
            break;
#endif
#if defined(DMX_USE_USART5)
        case USART5:
            Gd32GpioModeAf<USART5_GPIOx, USART5_TX_GPIO_PINx, USART5>();
            break;
#endif
#if defined(DMX_USE_UART6)
        case UART6:
            Gd32GpioModeAf<UART6_GPIOx, UART6_TX_GPIO_PINx, UART6>();
            break;
#endif
#if defined(DMX_USE_UART7)
        case UART7:
            Gd32GpioModeAf<UART7_GPIOx, UART7_TX_GPIO_PINx, UART7>();
            break;
#endif
        default:
            [[unlikely]] assert(0);
            __builtin_unreachable();
            break;
    }

    TIMER_CNT(TIMER5) = 0;
    do
    {
        __DMB();
    } while (TIMER_CNT(TIMER5) < RDM_TRANSMIT_MAB_TIME);

    for (uint32_t i = 0; i < length; i++)
    {
        do
        {
            __DMB();
        } while (!Gd32UsartFlagGet<USART_FLAG_TBE>(nUart));

        USART_TDATA(nUart) = USART_TDATA_TDATA & kData[i];
    }

    while (!Gd32UsartFlagGet<USART_FLAG_TC>(nUart))
    {
        static_cast<void>(GET_BITS(USART_RDATA(nUart), 0U, 8U));
    }

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
    sv_TotalStatistics[port_index].rdm.sent.classes = sv_TotalStatistics[port_index].rdm.sent.classes + 1;
#endif
}

void Dmx::RdmSendRaw(uint32_t port_index, const uint8_t* data, uint32_t length)
{
    DMX_CHECK_PORT_INDEX_VOID(port_index);

    switch (port_index)
    {
        case 0:
            RdmSendRawImpl<0, DmxPortToUart(0)>(data, length);
            break;
#if DMX_MAX_PORTS >= 2
        case 1:
            RdmSendRawImpl<1, DmxPortToUart(1)>(data, length);
            break;
#endif
#if DMX_MAX_PORTS >= 3
        case 2:
            RdmSendRawImpl<2, DmxPortToUart(2)>(data, length);
            break;
#endif
#if DMX_MAX_PORTS >= 4
        case 3:
            RdmSendRawImpl<3, DmxPortToUart(3)>(data, length);
            break;
#endif
#if DMX_MAX_PORTS >= 5
        case 4:
            RdmSendRawImpl<4, DmxPortToUart(4)>(data, length);
            break;
#endif
#if DMX_MAX_PORTS >= 6
        case 5:
            RdmSendRawImpl<5, DmxPortToUart(5)>(data, length);
            break;
#endif
#if DMX_MAX_PORTS >= 7
        case 6:
            RdmSendRawImpl<6, DmxPortToUart(6)>(data, length);
            break;
#endif
#if DMX_MAX_PORTS == 8
        case 7:
            RdmSendRawImpl<7, DmxPortToUart(7)>(data, length);
            break;
#endif
        default:
            [[unlikely]] break;
    }
}

void Dmx::RdmSendDiscoveryRespondMessage(uint32_t port_index, const uint8_t* data, uint32_t length)
{
    DMX_CHECK_PORT_INDEX_VOID(port_index);
    assert(data != nullptr);
    assert(length != 0);

    // 3.2.2 Responder Packet spacing
    udelay(RDM_RESPONDER_PACKET_SPACING, gsv_RdmDataReceiveEnd);

